# Terminal
cask "kitty"
cask "wezterm"

# Enviroment
brew "git"

# Enviroment
brew "z"
brew "tmux"
brew "fzf"
brew "fd"
brew "rg"
brew "wget"
brew "tree"
brew "watch"
brew "fswatch"
brew "reattach-to-user-namespace"
brew "htop"
brew "jq"
brew "cloc"
brew "coreutils"
brew "direnv"
brew "git-annex"
brew "bat"
brew "eza" # Maintained fork of exa
brew "gh" # Github CLI tool
brew "yazi" # tui file browser https://github.com/sxyazi/yazi

# Editors
brew "neovim"
brew "vim"
brew "helix"

# Programming
brew "fnm" # Node package no longer needed, use fnm instead
           # yarn / pnpm not needed, use corepack instead
brew "cmake"
brew "rustup"
brew "cargo-binstall"
brew "rust-analyzer"
brew "go"
brew "oven-sh/bun/bun"

cask "orbstack" # Docker Desktop alternative

# Cloud dev
brew "azure-cli"
brew "terraform"

# Windows manager (and shortcut manager)
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

# Password manager
cask "1password"
cask "1password-cli"

# Fonts
cask "font-symbols-only-nerd-font"

# AI
brew "ollama"

# Browsers
cask "google-chrome"
#cask "arc" # comment out for now since it was installed manually

# General casks
cask "dropbox"
cask "raycast"
cask "spotify"
cask "discord"
cask "vlc"
cask "disk-inventory-x"
cask "webtorrent"
cask "the-unarchiver"
cask "blender"
cask "obsidian"
cask "notion"

# Webdev casks
cask "forklift"
cask "postman"
cask "visual-studio-code"

# Work
cask "slack"
cask "microsoft-teams"
cask "ticktick"
cask "element" # matrix client

# Games
cask "minecraft"
cask "steam"

# Game streaming
cask "moonlight"
