# Terminal
cask "kitty"

# Enviroment
brew "git"
brew "z"
brew "tmux"
brew "fzf"
brew "fd"
brew "rg"
brew "wget"
brew "tree"
brew "watch"
brew "fswatch"
brew "reattach-to-user-namespace"
brew "htop"
brew "jq"
brew "cloc"
brew "coreutils"
brew "direnv"
brew "git-annex"
brew "bat"
brew "eza" # Maintained fork of exa
brew "gh" # Github CLI tool
brew "yazi" # tui file browser https://github.com/sxyazi/yazi
brew "hurl"
brew "icann-rdap"
brew "presenterm"
brew "mask" # Command runner based on markdown files

# Editors
brew "neovim"
brew "vim"
#brew "helix"
brew "evil-helix" # helix fork with vim keybindings

# Programming
brew "mise"
brew "cmake"
brew "rustup"
brew "cargo-binstall"
brew "rust-analyzer"
brew "go"
tap "oven-sh/bun"
brew "oven-sh/bun/bun"

cask "orbstack" # Docker Desktop alternative

# AI
cask "claude-code"
brew "opencode"

# Cloud dev
brew "azure-cli"
brew "awscli"
brew "tfenv" # terraform
cask "gcloud-cli"

# Windows manager (and shortcut manager)
tap "asmvik/formulae"
brew "asmvik/formulae/yabai"
brew "asmvik/formulae/skhd"

# Password manager
cask "1password"
cask "1password-cli"

# Fonts
cask "font-symbols-only-nerd-font"

# AI
brew "ollama"

# Browsers
cask "google-chrome"
cask "arc"

# General casks
cask "dropbox"
cask "raycast"
cask "spotify"
cask "discord"
cask "vlc"
cask "disk-inventory-x"
cask "webtorrent"
cask "the-unarchiver"
cask "blender"
cask "obsidian"
cask "notion"
cask "shortcat" # like vimium for the whole OS
cask "reaper"

# Webdev casks
cask "forklift"
cask "postman"
cask "visual-studio-code"

# Work
cask "slack"
cask "element" # matrix client

# Games
cask "minecraft"
cask "steam"

# Taskwarrior
brew "task"
